app/views/quotes/_form.html.erb

SELECT "authors".* FROM "authors"
---
    <%= f.label :author_id, "Select Existing Author", class: 'form-label' %>
    <%= f.select :author_id, [["(New author)", ""]] + Author.all.collect {|a| [a.is_anon ? "Anonymous" : "#{a.auth_fname} #{a.auth_lname}", a.id]}, {}, class: 'form-control', id: 'author-select' %>

SELECT "categories".* FROM "categories"
SELECT "categories"."id" FROM "categories" INNER JOIN "categorizations" ON "categories"."id" = "categorizations"."category_id" WHERE "categorizations"."quote_id" = 37
---
      <label>Select Categories</label>
      <% Category.all.each do |category| %>
        <div class="form-check">
          <%= check_box_tag "quote[category_ids][]", category.id, @quote.category_ids.include?(category.id), class: "form-check-input", id:"cat_#{category.id}" %>

SELECT "categories".* FROM "categories"
---
// Wait for the document to be fully loaded
document.addEventListener('DOMContentLoaded', function() {
  // Attach an event listener to detect clicks on the "Remove this category" link
  document.addEventListener('click', function(e) {
    if (e.target && e.target.classList.contains('remove-category')) {
      // Prevent the default action of the link
      e.preventDefault();

      // Get all the category fields
      const categoryFields = document.querySelectorAll('.category-field');
      // Only remove an category field if there's more than one
      if (categoryFields.length > 1) {
        e.target.closest('.category-field').remove();
      }
    }
  });
});