app/views/quotes/_quote.html.erb

    <!-- Author information, shown if present -->
    <% if quote.author.present? %>
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = 17 LIMIT 1