app/views/search/index.html.erb

    <div class="row">
      <% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"