app/views/home/uquotes.html.erb

                <h4 class = "card-title">
                    <% if quote.author.present? && quote.author.auth_fname.present? %>
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" IN (11, 17, 18)