app/controllers/authors_controller.rb

    def set_author
      @author = Author.find(params.expect(:id))
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = 1 LIMIT 1