app/controllers/home_controller.rb

SELECT "quotes".* FROM "quotes" WHERE "quotes"."is_public" = 1 ORDER BY "quotes"."created_at" DESC LIMIT 10
SELECT "authors".* FROM "authors" WHERE "authors"."id" IN (2, 3, 4, 5)
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (2, 1, 6, 3, 4)
---
  def index
    #index method loads 10 most recently submitted
    @quotes = Quote.includes(:author, :categories).where(is_public: true).order(created_at: :desc).limit(10)

SELECT "authors".* FROM "authors" WHERE "authors"."id" IN (3, 2, 7, 8, 9, 10, 1, 6)
SELECT "quotes".* FROM "quotes" WHERE "quotes"."user_id" IS NULL
---
  def uquotes
    #load quotes submitted by the logged in user
    @quotes = Quote.includes(:author).where(user_id: session[:user_id])