app/controllers/home_controller.rb

  def index
    @quotes = Quote.includes(:author, :categories).order(created_at: :desc).limit(10)
---
SELECT "quotes".* FROM "quotes" ORDER BY "quotes"."created_at" DESC LIMIT 10