app/controllers/quotes_controller.rb

SELECT "authors".* FROM "authors"
SELECT 1 AS one FROM "authors" WHERE LOWER("authors"."auth_fname") = LOWER('Ralph Waldo') AND "authors"."auth_lname" = 'Emerson' LIMIT 1
INSERT INTO "authors" ("auth_fname", "auth_lname", "birth_year", "death_year", "is_anon", "bio", "created_at", "updated_at") VALUES ('Charlie', NULL, 1889, 1977, 0, 'Black and white, silent picture move sensation', '2025-10-10 04:48:51.610403', '2025-10-10 04:48:51.610403') RETURNING "id"
INSERT INTO "authors" ("auth_fname", "auth_lname", "birth_year", "death_year", "is_anon", "bio", "created_at", "updated_at") VALUES ('', '', NULL, NULL, 0, '', '2025-10-10 23:38:44.234358', '2025-10-10 23:38:44.234358') RETURNING "id"
INSERT INTO "quotes" ("quote", "year", "is_public", "comment", "user_id", "author_id", "created_at", "updated_at") VALUES ('Life is a tragedy when seen in close up, but a comedy in long shot.', 1916, 1, 'My girlfriend''s quote when I asked her for a favourite, random quote.', 4, 14, '2025-10-10 04:48:51.654260', '2025-10-10 04:48:51.654260') RETURNING "id"
---
  def create
    @quote = Quote.new(quote_params)

    #if no author is selected,but new author fields have data
    if @quote.author_id.blank? && (new_author_params[:auth_fname].present? ||new_author_params[:auth_lname].present?)
      new_author = Author.create(new_author_params)
      @quote.author_id = new_author.id
    end

    respond_to do |format|
      if @quote.save

UPDATE "quotes" SET "quote" = 'Happiness depends upon ourselves.', "updated_at" = '2025-10-11 16:26:27.119230' WHERE "quotes"."id" = 40
---
  def update
    respond_to do |format|
      if @quote.update(quote_params)

DELETE FROM "quotes" WHERE "quotes"."id" = 25
---
  def destroy
    @quote.destroy!