app/controllers/search_controller.rb

SELECT DISTINCT "quotes".* FROM "quotes" INNER JOIN "categorizations" ON "categorizations"."quote_id" = "quotes"."id" INNER JOIN "categories" ON "categories"."id" = "categorizations"."category_id" WHERE "categories"."id" = 3 AND "quotes"."is_public" = 1
---
  def index
    if params[:category_ids].present?

      # Find quotes tagged with any of the selected categories, and hiding private quotes from the search
      @quotematch = Quote.joins(:categories).where(categories: { id: params[:category_ids] }).where(is_public: true).distinct