app/controllers/search_controller.rb

  def index
    if params[:category_ids].present?

      # Find quotes tagged with any of the selected categories
      @quotematch = Quote.joins(:categories).where(categories: { id: params[:category_ids] }).distinct
---
SELECT DISTINCT "quotes".* FROM "quotes" INNER JOIN "categorizations" ON "categorizations"."quote_id" = "quotes"."id" INNER JOIN "categorizations" "categorizations_quotes_join" ON "categorizations_quotes_join"."quote_id" = "quotes"."id" INNER JOIN "categories" ON "categories"."id" = "categorizations_quotes_join"."category_id" WHERE (categories.cat_name LIKE '%ethics%')