app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'bobbuilder@build.com' LIMIT 1
---
    def create

        # attempting to find the user in the database by the provided email
        user = User.find_by(email: params[:email])