app/controllers/users_controller.rb

INSERT INTO "users" ("fname", "lname", "email", "password_digest", "is_admin", "status", "created_at", "updated_at") VALUES ('Bob', 'Builder', 'bob@builder.com', '$2a$12$2WCc4zEZ7W95apVStbEPA.FvZady/9Cs7xUVGevEke2/cz/Ftl8ZC', 0, 'Active', '2025-10-08 02:34:53.121148', '2025-10-08 02:34:53.121148') RETURNING "id"
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "fname" = 'David', "password_digest" = '$2a$12$jCh6hXgWC43CGk.8pRE3.uInFty0YMUHyAXA4l7CflvcHJQgZLfFy', "updated_at" = '2025-10-13 02:43:41.136727' WHERE "users"."id" = 7
---
  def update
    respond_to do |format|
      if @user.update(user_params)